{
  "Python": {
    "1": {
      "title": "Чистый Python. Тонкости программирования для профи",
      "authors": [
        "Бейдер Д."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1145 р.",
      "description": "Изучение всех возможностей Python — сложная задача, а с этой книгой вы сможете сосредоточиться на практических навыках, которые действительно важны. Раскопайте «скрытое золото» в стандартной библиотеке Python и начните писать чистый код уже сегодня.• Если у вас есть опыт работы со старыми версиями Python, вы сможете ускорить работу с современными шаблонами и функциями, представленными на Python 3;• Если вы работали с другими языками программирования, и хотите перейти на Python, то найдете практические советы, необходимые для того, чтобы стать эффективным питонщиком; • Если вы хотите научиться писать чистый код, то найдете здесь самые интересные примеры и малоизвестные трюки.\"Чтобы освоить Python, нужно не только понимать теоретические аспекты языка. Для достижения этой цели придется понять и принять общие правила и самые лучшие практические приемы, используемые сообществом. Книга Дэна поможет вам в этом путешествии. Я убеждена, что, прочитав ее, вы почувствуете себя увереннее.\"Мариатта Виджайя, разработчик ядра Python (mariatta.ca)",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/4205/165449837/44610803.jpg",
      "isbn": "978-5-4461-0803-9"
    },
    "2": {
      "title": "Прикладной анализ текстовых данных на Python. Машинное обучение и создание приложений обработки естественного языка",
      "authors": [
        "Бенгфорт Б.",
        "Билбро Р.",
        "Охеда Т."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Технологии анализа текстовой информации стремительно меняются под влиянием машинного обучения. Нейронные сети из теоретических научных исследований перешли в реальную жизнь, и анализ текста активно интегрируется в программные решения. Нейронные сети способны решать самые сложные задачи обработки естественного языка, никого не удивляет машинный перевод, «беседа» с роботом в интернет-магазине, перефразирование, ответы на вопросы и поддержание диалога.Почему же Сири, Алекса и Алиса не хотят нас понимать, Google находит не то, что мы ищем, а машинные переводчики веселят нас примерами «трудностей перевода» с китайского на албанский? Ответ кроется в мелочах – в алгоритмах, которые правильно работают в теории, но сложно реализуются на практике.Научитесь применять методы машинного обучения для анализа текста в реальных задачах, используя возможности и библиотеки Python. От поиска модели и предварительной обработки данных вы перейдете к приемам классификации и кластеризации текстов, затем приступите к визуальной интерпретации, анализу графов, а после знакомства с приемами масштабирования научитесь использовать глубокое обучение для анализа текста.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/453/197992901/44611153.jpg",
      "isbn": "978-5-4461-1153-4"
    },
    "3": {
      "title": "Python: быстрый старт",
      "authors": [
        "Чан Д."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "499 р.",
      "description": "Всегда хотели научиться программировать на Python, но не знаете, с чего начать? Или хотите быстро перейти с другого языка на Python?Уже перепробовали множество книг и курсов, но ничего не подходит?Серия «Быстрый старт» — отличное решение, и вот почему: сложные понятия разбиты на простые шаги — вы сможете освоить язык Python, даже если никогда раньше не занимались программированием; все фундаментальные концепции подкреплены реальными примерами; вы получите полное представление о Python: структуры управления, методы обработки ошибок, концепции объектно-ориентированного программирования и т. д.; в конце книги вас ждет интересный проект, который поможет усвоить полученные знания.Ну что, готовы? Погнали!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5040/401118128/44611800.jpg",
      "isbn": "978-5-4461-1800-7"
    },
    "4": {
      "title": "Python, например",
      "authors": [
        "Лейси Н."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "499 р.",
      "description": "Это Python, например! Познакомьтесь с самым быстрорастущим языком программирования на сегодняшний день. Легкое и увлекательное руководство поможет шаг за шагом прокачать навыки разработки. Никаких архитектур компьютера, теорий программирования и прочей абракадабры — больше практики! В книге 150 задач, которые плавно перенесут читателя от изучения основ языка к решению более сложных вещей. Руководство подойдет всем, у кого голова идет кругом от технического жаргона и пространных объяснений — автор уверен, что учить можно и без этого.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1690/442279578/44611826.jpg",
      "isbn": "978-5-4461-1826-7"
    },
    "5": {
      "title": "Python для сложных задач: наука о данных и машинное обучение",
      "authors": [
        "Плас вандер Д."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1483 р.",
      "description": "Книга «Python Data Science Handbook» - это подробное руководство по самым разным вычислительным и статистическим методам, без которых немыслима любая интенсивная обработка данных, научные исследования и передовые разработки. Читатели, уже имеющие опыт программирования и желающие эффективно использовать Python в сфере Data Science, найдут в этой книге ответы на всевозможные вопросы, например: 1) как мне считать этот формат данных в мой скрипт? 2) Как преобразовать, очистить эти данные и манипулировать ими? 3) Как визуализировать данные такого типа? Как при помощи этих данных разобраться в ситуации, получить ответы на вопросы, построить статистические модели или реализовать машинное обучение?",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/463/162537935/44610914.jpg",
      "isbn": "978-5-4461-0914-2"
    },
    "6": {
      "title": "Программируем на Python",
      "authors": [
        "Доусон М."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "1064 р.",
      "description": "Эта книга — идеальное пособие для начинающих изучать Python. Руководство, написанное опытным разработчиком и преподавателем, научит фундаментальным принципам программирования на примере создания простых игр. Вы приобретете необходимые навыки для разработки приложений на Python и узнаете, как их применять в реальной практике.Для лучшего усвоения материала в книге приведено множество примеров программного кода. В конце каждой главы вы найдете проект полноценной игры, иллюстрирующий ключевые идеи изложенной темы, а также краткое резюме пройденного материала и задачи для самопроверки. Прочитав эту книгу, вы всесторонне ознакомитесь с языком Python, усвоите базовые принципы программирования и будете готовы перенести их на почву других языков, за изучение которых возьметесь.Научитесь программировать на Python играючи!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/662/218890902/44611386.jpg",
      "isbn": "978-5-4461-1386-6"
    },
    "7": {
      "title": "Путь Python. Черный пояс по разработке, масштабированию, тестированию и развертыванию",
      "authors": [
        "Данжу Д."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "1004 р.",
      "description": "«Путь Python» позволяет отточить ваши профессиональные навыки и узнать как можно больше о возможностях самого популярного языка программирования. Эта книга написана для разработчиков и опытных программистов. Вы научитесь писать эффективный код, создавать лучшие программы за минимальное время и избегать распространенных ошибок. Пора познакомиться с многопоточными вычислениями и мемоизацией, получить советы экспертов в области дизайна API и баз данных, а также заглянуть внутрь Python, чтобы расширит понимание языка.Вам предстоит начать проект, поработать с версиями, организовать автоматическое тестирование и выбрать стиль программирования для конкретной задачи. Потом вы перейдете к изучению эффективного объявления функции, выбору подходящих структур данных и библиотек, созданию безотказных программ, пакетам и оптимизации программ на уровне байт-кода. Из этой книги вы узнаете как:•       Создавать и использовать эффективные декораторы и методы•       Работать в функциональном стиле•       Расширять flake8 для работы с абстрактным синтаксическим деревом •       Использовать динамический анализ производительности для определения узких мест •       Работать с реляционными базами данных и эффективно управлять потоковыми данными с помощью PostgreSQL.Поднимите навыки владения Python с базового на высокий уровень. Получите советы экспертов и станьте профи!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5464/234214744/44611308.jpg",
      "isbn": "978-5-4461-1308-8"
    },
    "8": {
      "title": "Python и DevOps: Ключ к автоматизации Linux",
      "authors": [
        "Гифт Н.",
        "Берман К.",
        "Деза А.",
        "Георгиу Г."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1485 р.",
      "description": "За последнее десятилетие технологии сильно изменились. Данные стали хитом, облака — вездесущими, и всем организациям понадобилась автоматизация. В ходе таких преобразований Python оказался одним из самых популярных языков программирования. Это практическое руководство научит вас использовать Python для повседневных задач администрирования Linux с помощью наиболее удобных утилит DevOps, включая Docker, Kubernetes и Terraform.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/2944/475106176/44612929.jpg",
      "isbn": "978-5-4461-2929-4"
    },
    "9": {
      "title": "Простой Python. Современный стиль программирования. 2-е изд.",
      "authors": [
        "Любанович Б."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "«Простой Python» познакомит вас с одним из самых популярных языков программирования. Книга идеально подойдет как начинающим, так и опытным программистам, желающим добавить Python к списку освоенных языков. Любому программисту нужно знать не только язык, но и его возможности. Вы начнете с основ Python и его стандартной библиотеки. Узнаете, как находить, загружать, устанавливать и использовать сторонние пакеты. Изучите лучшие практики тестирования, отладки, повторного использования кода и получите полезные советы по разработке. Примеры кода и упражнения помогут в создании приложений для различных целей.Что изменилось?- Абсолютно новые 100 страниц (там есть котики).- Глав стало большое, но они стали короче.- Появилась глава, посвященная типам данных, переменным и именам.- Добавился рассказ о новых возможностях Python, таких как f-строки.- Обновилась информация о сторонних библиотеках.- Новые примеры кода.- Дан обзор библиотеки asyncio.- Рассмотрен новый стек технологий: контейнеры, облачные технологии, data science и машинное обучение.Что осталось неизменным? - Примеры c утками и плохими стихотворениями. Они навечно с нами.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7123/342162387/44611639.jpg",
      "isbn": "978-5-4461-1639-3"
    },
    "10": {
      "title": "Секреты Python Pro",
      "authors": [
        "Хиллард  Д."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "1850 р.",
      "description": "Код высокого качества — это не просто код без ошибок. Он должен быть чистым, удобочитаемым и простым в сопровождении. Путь от рядового питониста к профи не прост, для этого вам нужно разбираться в стиле, архитектуре приложений и процессе разработки. Книга «Секреты Python Pro» научит проектировать ПО и писать качественный код, то есть делать его понятным, сопровождаемым и расширяемым. Дейн Хиллард — профессиональный питонист, — с помощью примеров и упражнений он покажет вам как разбивать код на блоки, повышать качество за счет снижения сложности и т. д. Только освоив основополагающие принципы, вы сможете сделать так, чтобы чтение, сопровождение и переиспользование вашего кода не доставляло проблем ни вам ни вашим коллегам.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1403/375268731/44611684.jpg",
      "isbn": "978-5-4461-1684-3"
    },
    "11": {
      "title": "Современный скрапинг веб-сайтов с помощью Python. 2-е межд. издание",
      "authors": [
        "Митчелл  Р."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "1764 р.",
      "description": "Если программирование напоминает волшебство, то веб-скрапинг — это очень сильное колдунство. Написав простую автоматизированную программу, можно отправлять запросы на веб-серверы, запрашивать с них данные, а затем анализировать их и извлекать необходимую информацию. Новое расширенное издание книги знакомит не только с веб-скрапингом, но и поможет собрать любого вида данные в современном Интернете. В части I основное внимание уделено механике веб-скрапинга: как с помощью Python запрашивать информацию с веб-сервера, производить базовую обработку серверного отклика и организовать автоматизированное взаимодействие с сайтами. В части II исследованы более специфичные инструменты и приложения, которые пригодятся при любом сценарии веб-скрапинга.- Разбирайте сложные HTML-страницы.- Разрабатывайте поисковые роботы с помощью фреймворка Scrapy.- Изучайте методы хранения данных, полученных с помощью скрапинга.- Считывайте и извлекайте данные из документов.- Очищайте и нормализуйте плохо отформатированные данные.- Читайте и пишите информацию на естественных языках.- Освойте поиск по формам и логинам.- Изучите скрапинг JavaScript и работу с API.- Используйте и пишите программы для преобразования изображений в текст.- Учитесь обходить скрапинговые ловушки и блокаторы ботов.- Протестируйте собственный сайт с помощью скрапинга.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/3758/399109806/44611693.jpg",
      "isbn": "978-5-4461-1693-5"
    },
    "12": {
      "title": "Как устроен Python. Гид для разработчиков, программистов и интересующихся",
      "authors": [
        "Харрисон М."
      ],
      "year": "2019",
      "publisher": "Питер",
      "price": "399 р.",
      "description": "Python в моде! Это самый популярный язык программирования. Вакансии для Python-разработчиков входят в список самых высокооплачиваемых, а благодаря бурному развитию обработки данных, знание Python становится одним из самых востребованных навыков в среде аналитиков.Python - невероятный язык, популярный во многих областях. Он используется для автоматизации простых и сложных задач, цифровой обработки, веб-разработки, игр... Независимо от того, перешли ли вы на Python с другого языка, руководите группой программистов, работающих на Python, или хотите расширить свое понимание, имеет смысл подойти к изучению Python со всей серьезностью.Готовы начать карьеру питониста? Не теряйте времени на поиск информации, перелопачивая блоги и сайты, списки рассылок и группы. Мэтт Харрисон использует Python с 2000 года. Он занимался научными исследованиями, сборкой и тестированием, бизнес-аналитикой, хранением данных, а теперь делится своими знаниями как с простыми пользователями, так и с крупными корпорациями. Приобщитесь к передовому опыту и узнайте секреты внутренней кухни Python, доступные только профи, работающим с этим языком на протяжении многих лет.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7205/180485157/44610906.jpg",
      "isbn": "978-5-4461-0906-7"
    },
    "13": {
      "title": "Python. Лучшие практики и инструменты",
      "authors": [
        "Яворски М.",
        "Зиаде Т."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "2166 р.",
      "description": "Python — это динамический язык программирования, используемый в самых разных предметных областях. Хотя писать код на Python просто, гораздо сложнее сделать этот код удобочитаемым, пригодным для многократного использования и легким в поддержке. Третье издание «Python. Лучшие практики и инструменты» даст вам инструменты для эффективного решения любой задачи разработки и сопровождения софта.Авторы начинают с рассказа о новых возможностях Python 3.7 и продвинутых аспектах синтаксиса Python. Продолжают советами по реализации популярных парадигм, в том числе объектно-ориентированного, функционального и событийно-ориентированного программирования. Также авторы рассказывают о наилучших практиках именования, о том, какими способами можно автоматизировать развертывание программ на удаленных серверах. Вы узнаете, как создавать полезные расширения для Python на C, C++, Cython и CFFI.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/4250/417869978/44611589.jpg",
      "isbn": "978-5-4461-1589-1"
    },
    "14": {
      "title": "Основы Data Science и Big Data. Python и наука о данных",
      "authors": [
        "Силен Д.",
        "Мейсман А.",
        "Али  М."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Data Science — это совокупность понятий и методов, позволяющих придать смысл и понятный вид огромным объемам данных.Каждая из глав этой книги посвящена одному из самых интересных аспектов анализа и обработки данных. Вы начнете с теоретических основ, затем перейдете к алгоритмам машинного обучения, работе с огромными массивами данных, NoSQL, потоковым данным, глубокому анализу текстов и визуализации информации. В многочисленных практических примерах использованы сценарии Python. Обработка и анализ данных — одна из самых горячих областей IT, где постоянно требуются разработчики, которым по плечу проекты любого уровня, от социальных сетей до обучаемых систем. Надеемся, книга станет отправной точкой для вашего путешествия в увлекательный мир Data Science.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/4996/99840900/49602517.jpg",
      "isbn": "978-5-496-02517-1"
    },
    "15": {
      "title": "Python. Экспресс-курс. 3-е изд.",
      "authors": [
        "Седер Н."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1132 р.",
      "description": "Вы уже умеете кодить на одном или нескольких языках программирования? Тогда настала пора пройти экспресс-курс Python. Впервые на русском языке выходит новое издание одной из самых популярных книг издательства Manning. С помощью этой книги вы можете быстро перейти от основ к управлению и структурам данных, чтобы создавать, тестировать и развертывать полноценные приложения. Наоми Седер рассказывает не только об основных особенностях языка Python, но и его объектно-ориентированных возможностях, которые появились в Python 3. Данное издание учитывает все изменения, которые произошли с языком за последние 5 лет, а последние 5 глав рассказывают о работе с большими данными.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1536/184600064/44610908.jpg",
      "isbn": "978-5-4461-0908-1"
    },
    "16": {
      "title": "Python для сложных задач: наука о данных и машинное обучение",
      "authors": [
        "Плас вандер Д."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Книга «Python Data Science Handbook» - это подробное руководство по самым разным вычислительным и статистическим методам, без которых немыслима любая интенсивная обработка данных, научные исследования и передовые разработки. Читатели, уже имеющие опыт программирования и желающие эффективно использовать Python в сфере Data Science, найдут в этой книге ответы на всевозможные вопросы, например: 1) как мне считать этот формат данных в мой скрипт? 2) Как преобразовать, очистить эти данные и манипулировать ими? 3) Как визуализировать данные такого типа? Как при помощи этих данных разобраться в ситуации, получить ответы на вопросы, построить статистические модели или реализовать машинное обучение?",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/6337/127645889/49603068.jpg",
      "isbn": "978-5-496-03068-7"
    },
    "17": {
      "title": "Изучаем Python: программирование игр, визуализация данных, веб-приложения. 3-е изд.",
      "authors": [
        "Мэтиз Э."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1278 р.",
      "description": "«Изучаем Python» — это самое популярное в мире руководство по языку Python. Вы сможете не только максимально быстро его освоить, но и научитесь писать программы, устранять ошибки и создавать работающие приложения.В первой части книги вы познакомитесь с основными концепциями программирования, такими как переменные, списки, классы и циклы, а простые упражнения приучат вас к шаблонам чистого кода. Вы узнаете, как делать программы интерактивными и как протестировать код, прежде чем добавлять в проект. Во второй части вы примените новые знания на практике и создадите три проекта: аркадную игру в стиле Space Invaders, визуализацию данных с удобными библиотеками Python и простое веб-приложение, которое можно быстро развернуть онлайн.Работая с книгой, вы научитесь:-           Использовать мощные библиотеки и инструменты Python: Pygame, Matplotlib, Plotly и Django-           Создавать 2D-игры разной сложности,  которыми можно управлять с клавиатуры и мыши-           Создавать интерактивную визуализацию данных-           Разрабатывать, настраивать и развертывать веб-приложения -           Разбираться с багами и ошибкамиНовое издание было тщательно переработано и отражает последние достижения в практиках программирования на Python. Первая часть книги была дополнена новой информацией о f-строках, константах и управлении данными. Во второй части был обновлен код проектов. Структура проектов и код стали более чистыми и понятными, теперь они используют всю мощь популярных библиотек и инструментов, таких как Plotly и Django. (Полный список обновлений можно найти в предисловии.)Если вы подумываете «А не заняться ли мне программированием?», то эта книга — идеальный старт. Не нужно больше ждать! Погнали!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/6243/277706851/44611528.jpg",
      "isbn": "978-5-4461-1528-0"
    },
    "18": {
      "title": "Классические задачи Computer Science на языке Python",
      "authors": [
        "Копец Д."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "399 р.",
      "description": "Многие задачи в области Computer Science, которые на первый взгляд кажутся новыми или уникальными, на самом деле уходят корнями в классические алгоритмы, методы кодирования и принципы разработки. И устоявшиеся техники по-прежнему остаются лучшим способом решения таких задач! Научитесь писать оптимальный код для веб-разработки, обработки данных, машинного обучения и других актуальных сфер применения Python.Книга даст вам возможность глубже освоить язык Python, проверить себя на испытанных временем задачах, упражнениях и алгоритмах. Вам предстоит решать десятки заданий по программированию: от самых простых (например, найти элементы списка с помощью двоичной сортировки), до сложных (выполнить кластеризацию данных методом k-средних). Прорабатывая примеры, посвященные поиску, кластеризации, графам и пр., вы вспомните то, о чем успели позабыть и овладеете классическими приемами решения повседневных задач.В этой книге•\tАлгоритмы поиска.•\tОбобщенные технологии для графов.•\tНейронные сети.•\tГенетические алгоритмы.•\tСостязательный поиск.•\tИспользование аннотаций типов в описанных задачах.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/6170/245110810/44611428.jpg",
      "isbn": "978-5-4461-1428-3"
    },
    "19": {
      "title": "Однострочники Python: лаконичный и содержательный код",
      "authors": [
        "Майер К."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "981 р.",
      "description": "Краткость - сестра программиста. Эта книга научит вас читать и писать лаконичные и функциональные однострочники. Вы сможете системно разбирать и понимать код на Python, а также писать выразительно и компактно, как настоящий эксперт.Здесь вы найдете приёмы и хитрости написания кода, регулярные выражения, примеры использования однострочников в различных сферах, а также полезные алгоритмы. Подробные пояснения касаются в том числе и важнейших понятий computer science, что поспособствует вашему росту в программировании и аналитике.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1077/482313269/44612966.jpg",
      "isbn": "978-5-4461-2966-9"
    },
    "20": {
      "title": "Black Hat Python: программирование для хакеров и пентестеров, 2-е изд",
      "authors": [
        "Зейтц Д.",
        "Арнольд Т."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1071 р.",
      "description": "Когда речь идет о создании мощных и эффективных хакерских инструментов, большинство аналитиков по безопасности выбирают Python. Во втором издании бестселлера Black Hat Python вы исследуете темную сторону возможностей Python — все от написания сетевых снифферов, похищения учетных данных электронной почты и брутфорса каталогов до разработки мутационных фаззеров, анализа виртуальных машин и создания скрытых троянов.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5592/479884760/44613935.jpg",
      "isbn": "978-5-4461-3935-4"
    },
    "21": {
      "title": "Python: Искусственный интеллект, большие данные и облачные вычисления",
      "authors": [
        "Дейтел П.",
        "Дейтел Х."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "2661 р.",
      "description": "Пол и Харви Дейтелы предлагают по-новому взглянуть на Python и использовать уникальный подход, чтобы быстро решить проблемы, стоящие перед современными айтишниками. Вы на практике познакомитесь с революционными вычислительными технологиями и программированием на Python — одном из самых популярных языков. В вашем распоряжении более пятисот реальных задач — от фрагментов до 40 больших сценариев и примеров с полноценной реализацией. IPython с Jupyter Noteboos позволят быстро освоить современные идиомы программирования Python. Главы 1–5 и фрагменты глав 6–7 сделают понятными примеры решения задач искусственного интеллекта из глав 11–16. Вы познакомитесь с обработкой естественного языка, анализом эмоций в Twitter®, когнитивными вычислениями IBM® Watson™, машинным обучением с учителем в задачах классификации и регрессии, машинным обучением без учителя в задачах кластеризации, распознавания образов с глубоким обучением и сверточными нейронными сетями, рекуррентными нейронными сетями, большими данными с Hadoop®, Spark™ и NoSQL, IoT и многим другим. Вы поработаете (напрямую или косвенно) с облачными сервисами, включая Twitter, Google Translate™, IBM Watson, Microsoft® Azure®, OpenMapQuest, PubNub и др.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5496/301184376/44611432.jpg",
      "isbn": "978-5-4461-1432-0"
    },
    "22": {
      "title": "Паттерны разработки на Python: TDD, DDD и событийно-ориентированная архитектура",
      "authors": [
        "Персиваль Г.",
        "Грегори Б."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1045 р.",
      "description": "Популярность Python продолжает расти, а значит, проекты, созданные на этом языке программирования, становятся все масштабнее и сложнее. Многие разработчики проявляют интерес к высокоуровневым паттернам проектирования, таким как чистая и событийно-управляемая архитектура и паттерны предметно-ориентированного проектирования (DDD). Но их адаптация под Python не всегда очевидна. Гарри Персиваль и Боб Грегори познакомят вас с проверенными паттернами, чтобы каждый питонист мог управлять сложностью приложений и получать максимальную отдачу от тестов. Теория подкреплена примерами на чистом Python, лишенном синтаксической избыточности Java и C#. В этой книге:•\t«Инверсия зависимостей» и ее связи с портами и адаптерами (гексагональная/чистая архитектура).•\tРазличия между паттернами «Сущность», «Объект-значение» и «Агрегат» в рамках DDD.•\tПаттерны «Репозиторий» и UoW, обеспечивающие постоянство хранения данных.•\tПаттерны «Событие», «Команда» и «Шина сообщений».•\tРазделение ответственности на команды и запросы (CQRS).•\tСобытийно-управляемая архитектура и реактивные расширения.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5229/453669997/44611468.jpg",
      "isbn": "978-5-4461-1468-9"
    },
    "23": {
      "title": "Вероятностное программирование на Python: байесовский вывод и алгоритмы",
      "authors": [
        "Дэвидсон-Пайлон  К."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "1493 р.",
      "description": "Байесовские методы пугают формулами многих «айтишников», но без анализа статистики и вероятностей сейчас не обойтись. Кэмерон Дэвидсон-Пайлон рассказывает о байесовском методе с точки зрения программиста-практика, работающего с многофункциональным языком PyMC и библиотеками NumPy, SciPy и Matplotlib. Раскрывая роль байесовских выводов при А/В-тестировании, выявлении мошенничества и в других насущных задачах, вы не только легко разберетесь в этой нетривиальной теме, но и начнете применять полученные знания для достижения своих целей.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/3947/221253483/44611058.jpg",
      "isbn": "978-5-4461-1058-2"
    },
    "24": {
      "title": "Глубокое обучение с подкреплением на Python. OpenAI Gym и TensorFlow для профи",
      "authors": [
        "Равичандиран С."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "1150 р.",
      "description": "Глубокое обучение с подкреплением (Reinforcement Learning) — самое популярное и перспективное направление искусственного интеллекта. Практическое изучение RL на Python поможет освоить не только базовые, но и передовые алгоритмы глубокого обучения с подкреплением.Вы начнете с основных принципов обучения с подкреплением, OpenAI Gym и TensorFlow, познакомьтесь с марковскими цепями, методом Монте-Карло и динамическим программированием, так что «страшные» аббревиатуры DQN, DRQN, A3C, PPO и TRPO вскоре перестанут вас пугать. Вы узнаете об агентах, которые учатся на человеческих предпочтениях, DQfD, HER и многих других последних достижениях RL.Прочитав книгу, вы приобретете знания и опыт, необходимые для реализации обучения с подкреплением и глубокого обучения с подкреплением в реальных проектах, и войдете в мир искусственного интеллекта.В этой книге вы:•         Познакомитесь с основами методов, алгоритмов и элементов RL•         Обучите агента с помощью OpenAI Gym и Tensorflow•         Освоите марковские процессы принятия решений, оптимальность Беллмана и обучение TD•         Научитесь решать проблемы многоруких бандитов•         Овладеете алгоритмами глубокого обучения, такими как RNN, LSTM и CNN•         Создадите интеллектуальных агентов с помощью алгоритма DRQN, которые смогут играть в Doom•         С помощью DDPG научите агентов играть в Lunar Lander •         Отправите агента на автогонки, используя метод DQN",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/8161/237158369/44611251.jpg",
      "isbn": "978-5-4461-1251-7"
    },
    "25": {
      "title": "Обработка естественного языка. Python и spaCy на практике",
      "authors": [
        "Васильев Ю."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "1205 р.",
      "description": "Python и spaCy помогут вам быстро и легко создавать NLP-приложения: чат-боты, сценарии для сокращения текста или инструменты принятия заказов. Вы научитесь использовать spaCy для интеллектуального анализа текста, определять синтаксические связи между словами, идентифицировать части речи, а также определять категории для имен собственных. Ваши приложения даже смогут поддерживать беседу, создавая собственные вопросы на основе разговора.Вы научитесь:•\tРаботать с векторами слов, чтобы находить синонимы (глава 5).•\tВыявлять закономерности в данных с помощью displaCy — встроенного средства визуализации библиотеки spaCy (глава 7).•\tАвтоматически извлекать ключевые слова из пользовательского ввода и сохранять их в реляционной базе данных (глава 9).•\tРазвертывать приложения на примере чат-бота для взаимодействия с пользователями (глава 11).Прочитав эту книгу, вы можете сами расширить приведенные в ней сценарии, чтобы обрабатывать разнообразные варианты ввода и создавать приложения профессионального уровня.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/3277/421498061/44611506.jpg",
      "isbn": "978-5-4461-1506-8"
    },
    "26": {
      "title": "Глубокое обучение на Python",
      "authors": [
        "Шолле Ф."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "1038 р.",
      "description": "Глубокое обучение — Deep learning — это набор алгоритмов машинного обучения, которые моделируют высокоуровневые абстракции в данных, используя архитектуры, состоящие из множества нелинейных преобразований. Согласитесь, эта фраза звучит угрожающе. Но всё не так страшно, если о глубоком обучении рассказывает Франсуа Шолле, который создал Keras — самую мощную библиотеку для работы с нейронными сетями. Познакомьтесь с глубоким обучением на практических примерах из самых разнообразных областей. Книга делится на две части, в первой даны теоретические основы, вторая посвящена решению конкретных задач. Это позволит вам не только разобраться в основах DL, но и научиться использовать новые возможности на практике.\"Обучение — это путешествие длинной в жизнь, особенно в области искусственного интеллекта, где неизвестностей гораздо больше, чем определенности.\"Франсуа Шолле",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/2434/159271298/44610770.jpg",
      "isbn": "978-5-4461-0770-4"
    },
    "27": {
      "title": "Глубокое обучение: легкая разработка проектов на Python",
      "authors": [
        "Вейдман  С."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "2250 р.",
      "description": "Взрывной интерес к нейронным сетям и искусственному интеллекту затронул уже все области жизни, и понимание принципов глубокого обучения необходимо каждому разработчику ПО для решения прикладных задач.Эта практическая книга представляет собой вводный курс для всех, кто занимается обработкой данных, а также для разработчиков ПО. Вы начнете с основ глубокого обучения и быстро перейдете к более сложным архитектурам, создавая проекты с нуля. Вы научитесь использовать многослойные, сверточные и рекуррентные нейронные сети. Только понимая принцип их работы (от «математики» до концепций), вы сделаете свои проекты успешными.В этой книге: - Четкие схемы, помогающие разобраться в нейросетях, и примеры рабочего кода. - Методы реализации многослойных сетей с нуля на базе простой объектно-ориентированной структуры. - Примеры и доступные объяснения сверточных и рекуррентных нейронных сетей. - Реализация концепций нейросетей с помощью популярного фреймворка PyTorch.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1096/395576392/44611675.jpg",
      "isbn": "978-5-4461-1675-1"
    },
    "28": {
      "title": "Регулярные выражения. 3-е изд.",
      "authors": [
        "Фридл Д."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Вы никогда не пользовались регулярными выражениями? Откройте мир regex, и станьте профессионалом, способным эффективно работать с данными в Java, JavaScript, C, C++, C#, Perl, Python, Ruby, PHP и других языках программирования.Международный бестселлер знакомит с фундаментальными основами регулярных выражений, функциональными возможностями языков программирования и позволяет оптимизировать работу с информацией. Вы научитесь самостоятельно конструировать регулярные выражения и использовать приведенные в книге примеры для быстрого решения самых актуальных задач. «Незаменимая книга для волшебников текстовой обработки и новичков regex». - Пол Хадсон, Linux Format",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5596/158889436/44610646.jpg",
      "isbn": "978-5-4461-0646-2"
    },
    "29": {
      "title": "Обработка естественного языка в действии",
      "authors": [
        "Хобсон Л.",
        "Ханнес Х.",
        "Коул Х."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "2263 р.",
      "description": "Последние достижения в области глубокого обучения позволяют создавать приложения, с исключительной точностью распознающие текст и речь. Что в результате? Появляются чат-боты, ведущие диалог не хуже реальных людей, программы, эффективно подбирающие резюме под заданную вакансию, развивается превосходный предиктивный поиск, автоматически генерируются аннотации документов. Благодаря новым приемам и инструментам, таким как Keras и Tensorflow, сегодня возможно как никогда просто реализовать качественную обработку естественного языка (NLP).«Обработка естественного языка в действии» станет вашим руководством по созданию программ, способных распознавать и интерпретировать человеческий язык. В издании рассказано, как с помощью готовых пакетов на языке Python извлекать из текста смыслы и адекватно ими распоряжаться. В книге дается расширенная трактовка традиционных методов NLP, что позволит задействовать нейронные сети, современные алгоритмы глубокого обучения и генеративные приемы при решении реальных задач, таких как выявление дат и имен, составление текстов и ответов на неожиданные вопросы.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1064/302310440/44611371.jpg",
      "isbn": "978-5-4461-1371-2"
    },
    "30": {
      "title": "Знакомство с PyTorch: глубокое обучение при обработке естественного языка",
      "authors": [
        "Макмахан Б.",
        "Рао Д."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "1062 р.",
      "description": "Обработка текстов на естественном языке (Natural Language Processing, NLP) — крайне важная задача в области искусственного интеллекта. Успешная реализация делает возможными такие продукты, как Alexa от Amazon и Google Translate. Эта книга поможет вам изучить PyTorch — библиотеку глубокого обучения для языка Python — один из ведущих инструментов для дата-сайентистов и разработчиков ПО, занимающихся NLP.Делип Рао и Брайан Макмахан введут вас в курс дел с NLP и алгоритмами глубокого обучения. И покажут, как PyTorch позволяет реализовать приложения, использующие анализ текста.В этой книге•\tВычислительные графы и парадигма обучения с учителем.•\tОсновы оптимизированной библиотеки PyTorch для работы с тензорами.•\tОбзор традиционных понятий и методов NLP.•\tУпреждающие нейронные сети (многослойный перцептрон и другие).•\tУлучшение RNN при помощи долгой краткосрочной памяти (LSTM) и управляемых рекуррентных блоков •\tПредсказание и модели преобразования последовательностей.•\tПаттерны проектирования NLP-систем, используемых в продакшене.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/4494/251752846/44611241.jpg",
      "isbn": "978-5-4461-1241-8"
    },
    "31": {
      "title": "Объектно-ориентированный подход. 5-е межд. изд.",
      "authors": [
        "Вайсфельд М."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "399 р.",
      "description": "Объектно-ориентированное программирование (ООП) лежит в основе языков C++, Java, C#, Visual Basic .NET, Ruby, Objective-C и даже Swift. Не могут обойтись без объектов веб-технологии, ведь они используют JavaScript, Python и PHP.Именно поэтому Мэтт Вайсфельд советует выработать объектно-ориентированное мышление  и только потом  приступать к объектно-ориентированной разработке на конкретном языке программирования. Эта книга написана разработчиком для разработчиков, и позволяет выбрать оптимальные подходы для решения конкретных задач. Вы узнаете, как правильно применять наследование и композицию, поймете разницу между агрегацией и ассоциацией и перестанете путать интерфейс и реализацию.Технологии программирования непрерывно меняются и развиваются, но объектно-ориентированные концепции не зависят от платформы и остаются неизменно эффективными. В этом издании основное внимание уделяется фундаментальным основам ООП: паттернам проектирования, зависимостям и принципам SOLID, которые сделают ваш код понятным, гибким и хорошо сопровождаемым.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/197/270753989/44611431.jpg",
      "isbn": "978-5-4461-1431-3"
    },
    "32": {
      "title": "Эффективный Spark. Масштабирование и оптимизация",
      "authors": [
        "Карау Х.",
        "Уоррен Р."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Если у вас уже есть положительный опыт использования Spark для решения небольших задач, но вы по-прежнему ломаете голову – где та самая непревзойденная производительность Spark, позволяющая перемалывать колоссальные объемы данных – то эта книга для вас. Она расскажет, как эффективно использовать Spark для укрощения больших данных и вырасти из новичка в специалиста. Идеально подходит для программистов, инженеров по работе с данными, системных администраторов, обслуживающих крупномасштабные приложения",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5641/158782985/44610705.jpg",
      "isbn": "978-5-4461-0705-6"
    },
    "33": {
      "title": "Программируем с PyTorch: Создание приложений глубокого обучения",
      "authors": [
        "Пойнтер Я."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "450 р.",
      "description": "PyTorch – это фреймворк от Facebook с открытым исходным кодом. Узнайте, как использовать его для создания собственных нейронных сетей. Ян Пойнтер поможет разобраться, как настроить PyTorch в облачной среде, как создавать нейронные архитектуры, облегчающие работу с изображениями, звуком и текстом. Книга охватывает важнейшие концепции применения переноса обучения, модели отладки и использования библиотеки PyTorch. Вы научитесь:- Внедрять модели глубокого обучения в работу- Использовать PyTorch в масштабных проектах- Применять перенос обучения- Использовать PyTorch torchaudio и сверточные модели для классификации аудиоданных - Применять самые современные методы NLP, используя модель, обученную на «Википедии»- Выполнять отладку моделей PyTorch с TensorBoard и флеймграф- Развертывать приложения PyTorch в контейнерах«PyTorch –– это одна из самых быстрорастущих библиотек глубокого обучения, соперничающая с гигантом Google — TensorFlow — практически на равных. Книга обязательно должна стать настольной для каждого программиста и разработчика алгоритмов машинного обучения, которые хотят использовать PyTorch в своей работе».Анкур Патель, вице-президент направления Data Science в компании 7Park DataЯн Пойнтер (Ian Pointer) — дата-инженер – создает решения машинного обучения для клиентов из списка Fortune 100. В настоящее время работает в Lucidworks, где занимается разработкой NLP-приложений и проектированием.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7450/301243674/44611677.jpg",
      "isbn": "978-5-4461-1677-5"
    },
    "34": {
      "title": "Грокаем глубокое обучение",
      "authors": [
        "Траск Э."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "931 р.",
      "description": "Глубокое обучение — это раздел искусственного интеллекта, цель которого научить компьютеры обучаться с помощью нейронных сетей — технологии, созданной по образу и подобию человеческого мозга. Онлайн-переводчики, беспилотные автомобили, рекомендации по выбору товаров именно для вас и виртуальные голосовые помощники — вот лишь несколько достижений, которые стали возможны, благодаря глубокому обучению. «Грокаем глубокое обучение» научит конструировать нейронные сети с нуля! Эндрю Траск знакомит со всеми деталями и тонкостями этой нелегкой задачи. Python и библиотека NumPy способны научить ваши нейронные сети видеть и распознавать изображения, переводить любые тексты на все языки мира и даже писать не хуже Шекспира! Что вы найдете внутри книги-             Теоретические основы глубокого обучения-             Приемы создания и обучения нейронных сетей -             Работа с естественным языком-             Федеративное обучение и работа с конфиденциальными даннымиВам не понадобятся специальные навыки, выходящие за рамки школьного курса математики и базовых навыков программирования",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7554/226794882/44611334.jpg",
      "isbn": "978-5-4461-1334-7"
    },
    "35": {
      "title": "Data mining. Извлечение информации из Facebook, Twitter, LinkedIn, Instagram, GitHub",
      "authors": [
        "Рассел М.",
        "Классен М."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "В недрах популярных социальных сетей — Twitter, Facebook, LinkedIn и Instagram — скрыты богатейшие залежи информации. Из этой книги исследователи, аналитики и разработчики узнают, как извлекать эти уникальные данные, используя код на Python, Jupyter Notebook или контейнеры Docker.Сначала вы познакомитесь с функционалом самых популярных  социальных сетей (Twitter, Facebook, LinkedIn, Instagram), веб-страниц, блогов и лент, электронной почты и GitHub. Затем приступите к анализу данных на примере Twitter.Прочитайте эту книгу, чтобы•         Узнать о современном ландшафте социальных сетей•         Научиться использовать Docker, чтобы легко оперировать кодами, приведенными в книге;•         Узнать, как адаптировать и поставлять код в открытый репозиторий GitHub;•         Научиться анализировать собираемые данные с использованием возможностей Python 3;•         Освоить продвинутые приемы анализа, такие как TFIDF, косинусное сходство, анализ словосочетаний, определение клика и распознавание образов;•         Узнать, как создавать красивые визуализации данных с помощью Python и JavaScript.Мэтью Рассел (Matthew Russell) — директор Built Technologies, он возглавляет команду лидеров, работающую над улучшением нашего мира. Вне работы Мэтью рациональный индивидуалист, готовящийся к возможному зомби-апокалипсису.Михаил Классен (Mikhail Klassen) — главный специалист по обработке и анализу данных в Paladin AI, стартапе, занимающемуся адаптивными технологиями обучения. Он увлекается проблемами искусственного интеллекта и анализом данных. Когда Михаил не занят на работе, он любит читать и путешествовать.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/329/234938697/44611246.jpg",
      "isbn": "978-5-4461-1246-3"
    },
    "36": {
      "title": "Head First. Kotlin",
      "authors": [
        "Гриффитс Д."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Вот и настало время изучить Kotlin. В этом вам поможет уникальная методика Head First, выходящая за рамки синтаксиса и инструкций по решению конкретных задач. Хотите мыслить, как выдающиеся разработчики Kotlin? Эта книга даст вам все необходимое — от азов языка до продвинутых методов. А еще вы сможете попрактиковаться в объектно-ориентированном и функциональном программировании. Если вы действительно хотите понять, как устроен Kotlin, то эта книга для вас!Почему эта книга не похожа на другие?Подход Head First основан на новейших исследованиях в области когнитивистики и теории обучения. Визуальный формат позволяет вовлечь в обучение мозг читателя лучше, чем длинный текст, который вгоняет в сон. Зачем тратить время на борьбу с новыми концепциями? Head First задействует разные каналы получения информации и разрабатывался с учетом особенностей работы вашего мозга.«Четко, доступно, просто для понимания. Если вы только осваиваете Kotlin, эта книга станет отличным вводным пособием».— Кен Коусен (Ken Kousen)Сертифицированный преподаватель Kotlin«Head First Kotlin поможет вам быстро проникнуть в суть дела, заложить надежный фундамент и (снова) получать удовольствие от написания кода». — Инго Кроцки (Ingo Krotzky), изучающий Kotlin«Наконец-то! Kotlin для тех, кто не знает Java. Просто, лаконично и занимательно. Я давно ждал появления такой книги».— Доктор Мэтт Венэм (Dr. Matt Wenham), специалист по data science и программист Python",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1249/249464033/44611335.jpg",
      "isbn": "978-5-4461-1335-4"
    },
    "37": {
      "title": "Head First. Изучаем Go",
      "authors": [
        "Макгаврен Д."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "2395 р.",
      "description": "Go упрощает построение простых, надежных и эффективных программ. А эта книга сделает его доступным для обычных программистов. Основная задача Go — эффективная работа с сетевыми коммуникациями и многопроцессорной обработкой, но код на этом языке пишется и читается не сложнее чем на Python и JavaScript. Простые примеры позволят познакомиться с языком в действии и сразу приступить к программированию на Go. Так что вы быстро освоите общепринятые правила и приемы, которые позволят вам называть себя гофером.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7255/284499031/44611395.jpg",
      "isbn": "978-5-4461-1395-8"
    },
    "38": {
      "title": "BPF для мониторинга Linux",
      "authors": [
        "Калавера Д.",
        "Фонтана Л."
      ],
      "year": "2021",
      "publisher": "Питер",
      "price": "1132 р.",
      "description": "Виртуальная машина BPF — один из важнейших компонентов ядра Linux. Её грамотное применение позволит системным инженерам находить сбои и решать даже самые сложные проблемы.Вы научитесь создавать программы, отслеживающие и модифицирующие поведение ядра, сможете безопасно внедрять код для наблюдения событий в ядре и многое другое.Дэвид Калавера и Лоренцо Фонтана помогут вам раскрыть возможности BPF. Расширьте свои знания об оптимизации производительности, сетях, безопасности. - Используйте BPF для отслеживания и модификации поведения ядра Linux.- Внедряйте код для безопасного мониторинга событий в ядре — без необходимости перекомпилировать ядро или перезагружать систему.- Пользуйтесь удобными примерами кода на C, Go или Python.- Управляйте ситуацией, владея жизненным циклом программы BPF.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1405/314484093/44611624.jpg",
      "isbn": "978-5-4461-1624-9"
    },
    "39": {
      "title": "Data Science. Инсайдерская информация для новичков. Включая язык R",
      "authors": [
        "О Нил К.",
        "Шатт  Р."
      ],
      "year": "2019",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Data Science (исследование данных) - одна из самых востребованных специализаций нашего времени. Изучение данных позволяет преобразить любую традиционную или инновационную бизнес-модель.  Эта книга основана на вводном курсе по Data Science из Колумбийского университета, и начинающему специалисту-аналитику она совершенно необходима. Эта книга увлекательно и доступно рассказывает оБайесовском методеСтатистических алгоритмахФинансовом моделированииРекомендательных движкахВизуализации данныхMapReduceс примерами на языках Python и R",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/3917/181579597/44610622.jpg",
      "isbn": "978-5-4461-0622-6"
    },
    "40": {
      "title": "Прагматичный ИИ. Машинное обучение и облачные технологии",
      "authors": [
        "Гифт Н."
      ],
      "year": "2019",
      "publisher": "Питер",
      "price": "1322 р.",
      "description": "Искусственный интеллект - это мощный инструмент в руках современного архитектора, разработчика и аналитика.Облачные технологии - ваш путь к укрощению искусственного интеллекта.   Тщательно изучив эту незаменимую книгу от Ноя Гифта, легендарного эксперта по языку Python, вы легко научитесь писать облачные приложения с использованием средств искусственного интеллекта и машинного обучения, решать реалистичные задачи из таких востребованных и актуальных областей, как спортивный маркетинг, управление проектами, ценообразование, сделки с недвижимостью. Все примеры разобраны на языке Python, #1 в сфере современных стремительных вычислений",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7440/193682704/44611061.jpg",
      "isbn": "978-5-4461-1061-2"
    },
    "41": {
      "title": "Разработка с использованием квантовых компьютеров",
      "authors": [
        "Силва В."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "1597 р.",
      "description": "Квантовые вычисления не просто меняют реальность! Совершенно новая отрасль рождается на наших глазах, чтобы создать немыслимое ранее и обесценить некоторые достижения прошлого.В этой книге рассмотрены наиболее важные компоненты квантового компьютера: кубиты, логические вентили и квантовые схемы, а также объясняется отличие квантовой архитектуры от традиционной. Вы сможете бесплатно экспериментировать с ними как в симуляторе, так и на реальном квантовом устройстве с применением IBM Q Experience.Вы узнаете, как выполняются квантовые вычисления с помощью QISKit (программный инструментарий для обработки квантовой информации), Python SDK и других API, в частности QASM.Наконец, вы изучите современные квантовые алгоритмы, реализующие запутанность, генерацию случайных чисел, линейный поиск, факторизацию целых чисел и др. Разберетесь с состояниями Белла, описывающими запутанность, алгоритмом Гровера для линейного поиска, алгоритмом Шора для факторизации целых чисел, алгоритмами оптимизации и многим другим.Вы научитесь:•\tУдаленно запускать программы, пользуясь Q Experience REST API.•\tПисать алгоритмы, обеспечивающие высочайшую производительность по сравнению с аналогами для традиционных компьютеров.•\tСоздавать REST-клиент на Node.js для аутентификации, прослушивания удаленных устройств, запроса информации о квантовых процессорах, удаленного контроля и запуска экспериментов в облаке.•\tИспользовать квантовую телепортацию. Воспользовавшись классическими вычислениями и квантовой запутанностью между отправителем и получателем, передавать точное состояние кубита (квантовой информации).•\tПрограммировать и играть в квантовый вариант «Морского боя».•\tИспользовать Q Experience Composer для создания визуальных программ/экспериментов.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/6384/271735024/44611429.jpg",
      "isbn": "978-5-4461-1429-0"
    },
    "42": {
      "title": "Эффективный C. Профессиональное программирование",
      "authors": [
        "Сикорд Р."
      ],
      "year": "2022",
      "publisher": "Питер",
      "price": "1440 р.",
      "description": "Мир работает на коде, написанном на C, но в большинстве учебных заведений программированию учат на Python или Java. Книга «Эффективный С для профессионалов» восполняет этот пробел и предлагает современный взгляд на C. Здесь рассмотрен C17, а также потенциальные возможности C2x. Издание неизбежно станет классикой, с его помощью вы научитесь писать профессиональные и надежные программы на C, которые лягут в основу устойчивых систем и решат реальные задачи.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5587/462935507/44611851.jpg",
      "isbn": "978-5-4461-1851-9"
    },
    "43": {
      "title": "Глубокое обучение в картинках. Визуальный гид по искусственному интеллекту",
      "authors": [
        "Крон Д.",
        "Бейлевельд Г.",
        "Бассенс  А."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": "1318 р.",
      "description": "Глубокое обучение стало мощным двигателем для работы с искусственным интеллектом. Яркие иллюстрации и простые примеры кода избавят вас от необходимости вникать в сложные аспекты конструирования моделей глубокого обучения, делая сложные задачи доступными и увлекательными.Джон Крон, Грант Бейлевельд  и замечательный иллюстратор Аглаэ Бассенс используют яркие примеры и аналогии, которые позволяют объяснить, что такое глубокое обучение, почему оно пользуется такой популярностью и как эта концепция связана с другими подходами к машинному обучению. Книга идеально подойдет разработчикам, специалистам по обработке данных, исследователям, аналитикам и начинающим программистам, которые хотят применять глубокое обучение в своей работе. Теоретические выкладки прекрасно дополняются прикладным кодом на Python в блокнотах Jupyter. Вы узнаете приемы создания эффективных моделей в TensorFlow и Keras, а также познакомитесь с PyTorch.Базовые знания о глубоком обучении позволят создавать реальные приложения — от компьютерного зрения и обработки естественного языка до генерации изображений и игровых алгоритмов.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7002/309943130/44611574.jpg",
      "isbn": "978-5-4461-1574-7"
    },
    "44": {
      "title": "Машинное обучение",
      "authors": [
        "Бринк Х.",
        "Ричардс Д.",
        "Феверолф М."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "В последние годы машинное обучение вышло на уровень большого бизнеса: компании активно используют его для зарабатывания денег, прикладные исследования бурно развиваются, а неугомонные разработчики используют любую возможность повысить свой уровень владения данной тематикой.Данная книга рассчитана на тех, кто хочет решать самые разнообразные задачи при помощи машинного обучения. Как правило, для этого нужен Python, поэтому в примерах кода используется этот язык, а также библиотеки pandas и scikit-learn. Вы познакомитесь с основными понятиями ML, такими как сбор данных, моделирование, классификация и регрессия, а главное, получите практический опыт обработки реальных данных.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/3332/117853444/49602989.jpg",
      "isbn": "978-5-496-02989-6"
    },
    "45": {
      "title": "Глубокое обучение на R",
      "authors": [
        "Шолле Ф."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": "550 р.",
      "description": "Глубокое обучение — Deep learning — это набор алгоритмов машинного обучения, которые моделируют высокоуровневые абстракции в данных, используя архитектуры, состоящие из множества нелинейных преобразований. Согласитесь, эта фраза звучит угрожающе. Но всё не так страшно, если о глубоком обучении рассказывает Франсуа Шолле, который создал Keras — самую мощную библиотеку для работы с нейронными сетями. Познакомьтесь с глубоким обучением на практических примерах из самых разнообразных областей. Книга делится на две части, в первой даны теоретические основы, вторая посвящена решению конкретных задач. Это позволит вам не только разобраться в основах DL, но и научиться использовать новые возможности на практике. Эта книга написана для людей с опытом программирования на R, желающих быстро познакомиться с глубоким обучением на практике, и является переложением бестселлера Франсуа Шолле \"Глубокое обучение на Python\", но использующим примеры на базе интерфейса R для Keras.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1690/162457242/44610902.jpg",
      "isbn": "978-5-4461-0902-9"
    },
    "46": {
      "title": "Изучаем Python. Программирование игр, визуализация данных, веб-приложения",
      "authors": [
        "Мэтиз Э."
      ],
      "year": "2017",
      "publisher": "Питер",
      "price": null,
      "description": "Книга \"Изучаем Python\" — это ускоренный курс, который позволит вам сэкономить время и сразу начать писать работоспособные программы (игры, визуализации данных, веб-приложения и многое другое).Хотите стать программистом? В первой части книги вам предстоит узнать о базовых принципах программирования, познакомиться со списками, словарями, классами и циклами, вы научитесь создавать программы и тестировать код. Во второй части книги вы начнете использовать знания на практике, работая над тремя крупными проектами: создадите собственную «стрелялку» с нарастающей сложностью уровней, займетесь работой с большими наборами данных и освоите их визуализацию, и, наконец, создадите полноценное веб-приложение на базе Django, гарантирующее конфиденциальность пользовательской информации.Если вы решились разобраться в том что такое  программирование, не нужно ждать. Ключ на старт и вперед!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/7146/91323370/49602305.jpg",
      "isbn": "978-5-496-02305-4"
    },
    "47": {
      "title": "Простой Python. Современный стиль программирования",
      "authors": [
        "Любанович Б."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": null,
      "description": "Эта книга идеально подходит как для начинающих программистов, так и для тех, кто только собирается осваивать Python, но уже имеет опыт программирования на других языках. В ней подробно рассматриваются самые современные пакеты и библиотеки Python. Стилистически издание напоминает руководство с вкраплениями кода, подробно объясняя различные концепции Python 3. Под обложкой вы найдете обширный материал от самых основ языка до сравнительно сложных и узких тем.Прочитав эту книгу, вы не только убедитесь, что Python — это вкусно, но и освоите искусство тестирования, отладки, многократного использования кода, а также научитесь применять Python в различных предметных областях.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/1304/174794008/44611054.jpg",
      "isbn": "978-5-4461-1054-4"
    },
    "48": {
      "title": "Изучаем Python. Программирование игр, визуализация данных, веб-приложения. 2-е изд.",
      "authors": [
        "Мэтиз Э."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": null,
      "description": "Книга \"Изучаем Python\" — это ускоренный курс, который позволит вам сэкономить время и сразу начать писать работоспособные программы (игры, визуализации данных, веб-приложения и многое другое).Хотите стать программистом? В первой части книги вам предстоит узнать о базовых принципах программирования, познакомиться со списками, словарями, классами и циклами, вы научитесь создавать программы и тестировать код. Во второй части книги вы начнете использовать знания на практике, работая над тремя крупными проектами: создадите собственную «стрелялку» с нарастающей сложностью уровней, займетесь работой с большими наборами данных и освоите их визуализацию, и, наконец, создадите полноценное веб-приложение на базе Django, гарантирующее конфиденциальность пользовательской информации.Если вы решились разобраться в том что такое  программирование, не нужно ждать. Ключ на старт и вперед!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/3559/239603175/44610479.jpg",
      "isbn": "978-5-4461-0479-6"
    },
    "49": {
      "title": "Простой Python. Современный стиль программирования",
      "authors": [
        "Любанович Б."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": null,
      "description": "Эта книга идеально подходит как для начинающих программистов, так и для тех, кто только собирается осваивать Python, но уже имеет опыт программирования на других языках. В ней подробно рассматриваются самые современные пакеты и библиотеки Python. Стилистически издание напоминает руководство с вкраплениями кода, подробно объясняя различные концепции Python 3. Под обложкой вы найдете обширный материал от самых основ языка до сравнительно сложных и узких тем.Прочитав эту книгу, вы не только убедитесь, что Python — это вкусно, но и освоите искусство тестирования, отладки, многократного использования кода, а также научитесь применять Python в различных предметных областях.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/2182/81324166/49602088.jpg",
      "isbn": "978-5-496-02088-6"
    },
    "50": {
      "title": "Основы Data Science и Big Data. Python и наука о данных",
      "authors": [
        "Силен Д.",
        "Мейсман А.",
        "Али  М."
      ],
      "year": "2020",
      "publisher": "Питер",
      "price": null,
      "description": "Data Science — это совокупность понятий и методов, позволяющих придать смысл и понятный вид огромным объемам данных.Каждая из глав этой книги посвящена одному из самых интересных аспектов анализа и обработки данных. Вы начнете с теоретических основ, затем перейдете к алгоритмам машинного обучения, работе с огромными массивами данных, NoSQL, потоковым данным, глубокому анализу текстов и визуализации информации. В многочисленных практических примерах использованы сценарии Python. Обработка и анализ данных — одна из самых горячих областей IT, где постоянно требуются разработчики, которым по плечу проекты любого уровня, от социальных сетей до обучаемых систем. Надеемся, книга станет отправной точкой для вашего путешествия в увлекательный мир Data Science.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/6672/239761936/44610944.jpg",
      "isbn": "978-5-4461-0944-9"
    },
    "51": {
      "title": "Minecraft. Программируй свой мир на Python. 2-е межд. изд.",
      "authors": [
        "Вэйл Д.",
        "О`Хэнлон  М."
      ],
      "year": "2018",
      "publisher": "Питер",
      "price": null,
      "description": "Любишь играть в Minecraft? Тебе нравится узнавать новое и придумывать то, чего раньше не существовало? Хочешь построить собственный виртуальный мир, которому будут завидовать все друзья? Можно ли объединить Minecraft и программирование? Нужно! Теперь ты будешь не только играть и жить в удивительном мире Minecraft, но и научишься программировать на Python. Простые инструкции и советы помогут воплотить  свои идеи в жизнь, построить дом и 3D-копировальную машину, найти сокровища и даже завести в своем \"огороде\" гигантские работающие часы. Прочитай эту книгу и превратись в настоящего демиурга, который способен создать свой мир и защитить его от инопланетян.Теперь на Python 3!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/942/166609838/44610951.jpg",
      "isbn": "978-5-4461-0951-7"
    },
    "52": {
      "title": "Hello World! Занимательное программирование",
      "authors": [
        "Сэнд У.",
        "Сэнд К."
      ],
      "year": "2017",
      "publisher": "Питер",
      "price": null,
      "description": "Привет! Любишь компьютерные игрушки? А хочешь попробовать написать что-нибудь сам?  Представь, как зауважают тебя друзья, когда ты покажешь им игру своей собственной разработки, где при загрузке на экране появится твое имя!  «Вот круто!» — будут говорить они, качая ее с твоей странички. И самая красивая девочка в классе, узнав об этом, наконец обратит на тебя внимание... Но для этого надо научиться программировать. Это сложно? Ну, на самом деле не очень. Главное — поставить себе цель и ломиться к ней напролом, как носорог через джунгли. Ты наверняка знаешь, что языков программирования существует немало, но мы предлагаем тебе научиться «писать код», как говорят профессионалы, на языке Python (Питон). Он относительно прост в изучении, но обладает всеми необходимыми функциями. Программы на нем получаются быстрыми и легко читаемыми.Эту книгу по языку Python написали два человека. Взрослый дядька-программист и его сын. Этот сын тоже совсем недавно был подростком, знает как порой муторно бывает учиться, и поэтому он проследил, чтобы папа объяснялся не очень заумно. Так что если ты никогда не программировал, не беда. Если ты знаком с азами — e-mail, Интернет, mp3, можешь запустить или сохранить файл, — ты во всем разберешься. Удачи в освоении!",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/4067/68571107/49601273.jpg",
      "isbn": "978-5-496-01273-7"
    },
    "53": {
      "title": "Android для разработчиков",
      "authors": [
        "Дейтел П.",
        "Дейтел Х.",
        "Дейтел Э."
      ],
      "year": "2015",
      "publisher": "Питер",
      "price": null,
      "description": "Более миллиона человек во всем мире воспользовались книгами Дейтелов, чтобы освоить Java, C#, C++, C, веб-программирование, JavaScript, XML, Visual Basic, Visual C++, Perl, Python и другие языки программирования. Майкл Моргано является профессиональным разработчиком Android компании Imerj.Эта книга, выходящая уже во втором издании, даст вам всё, что нужно, для начала разработки приложений для Android и быстрой публикации их на Google Play. Авторы используют приложение-ориентированный подход, при котором  описание каждой технологии рассматривается на примере 7 полностью протестированных приложений для Android. Кроме описания процесса создания приложений, в книге дано пошаговое руководство по размещению ваших приложений на Google Play и примеры успешных публикаций. Новое издании книги полностью обновлено и содержит информацию о работе с Android 4.3 и 4.4, разработке на Eclipse и новом Android Studio.",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/3449/46656889/49601517.jpg",
      "isbn": "978-5-496-01517-2"
    },
    "54": {
      "title": "Теория и практика языков программирования. Учебник для вузов. 2-е изд. Стандарт 3-го поколения",
      "authors": [
        "Орлов С. А."
      ],
      "year": "2017",
      "publisher": "Питер",
      "price": "800 р.",
      "description": "Учебник посвящен систематическому изложению теории и практики языков программирования. Он отражает классическое содержание учебной дисциплины по языкам программирования. Все сложные вопросы поясняются законченными примерами. Кроме того, здесь предлагается полный комплекс задач и упражнений по узловым вопросам. Учебник охватывает базисные разделы следующих дисциплин: теория формальных языков, теория автоматов и формальных языков, языки программирования, программирование, объектно-ориентированное программирование, логическое и функциональное программирование, теория вычислительных процессов. В новом издании обсуждаются характеристики, а также последние тенденции развития универсальных языков программирования высокого уровня, таких как Scala, Go и Swift; поясняются главные особенности последних стандартов классических языков C++, Java и C#: лямбда-выражения во всех этих языках, cсылочный тип rvalue и семантика перемещения в языке C++ 11, ковариантность и контрвариантность родовых шаблонов в C#; существенно расширено представление скриптового языка Ruby, рассматриваются его блоки, механизмы единичного наследования и подмешивания, а также утиной типизации; добавлено описание аппарата событий и программирования на основе событий; показано применение стиля функционального программирования в скриптовых и объектно-ориентированных языках Python, Ruby, C#, Java, C++, Scala, Go и Swift.Учебник предназначен для студентов инженерного, бакалаврского и магистерского уровней компьютерных специальностей, может быть полезен преподавателям и исследователям/разработчикам трансляторов и другого программного обеспечения.Рекомендовано Санкт-Петербургским институтом информатики и автоматизации Российской академии наук (СПИИРАН) в качестве учебника по направлению «Информатика и вычислительная техника».",
      "category": "Python",
      "iamge": "https://static-sl.insales.ru/images/products/1/5201/239768657/44610491.jpg",
      "isbn": "978-5-4461-0491-8"
    }
  }
}